# 2. Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]
# _______________________________________________________________
numbers_list = [1]
a = int(input("Введите число: "))
for i in range(2, a + 1):
    numbers_list.append(numbers_list[i-2]*i)
print(numbers_list)

